#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура МассовоеСозданиеРеализацийУслуг(Договоры, Период) Экспорт
	
	Всего = Договоры.Количество();
	Сч = 0;
	
	Для Каждого Договор Из Договоры Цикл
		
		ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДокументОбъект.Дата = КонецМесяца(Период);
		ДокументОбъект.Организация = Договор.Организация;
		ДокументОбъект.Контрагент = Договор.Контрагент;
		ДокументОбъект.Договор = Договор.Ссылка;
		ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
		
		ДокументОбъект.ВыполнитьАвтозаполнение();
		
		Если ДокументОбъект.Услуги.Количество() <> 0 Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		Сч = Сч + 1;
		ДлительныеОперации.СообщитьПрогресс(Сч/Всего * 100);
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли